#version: 0.2
Ġ Ġ
ĠĠ ĠĠ
ĠĠ Ġ
e r
e l
Ċ ĠĠĠĠ
e t
l a
u r
0 1
2 01
a l
c o
ĊĠĠĠĠ ĠĠĠ
Ġ "
Ċ ĠĠĠ
i al
ial i
b el
la bel
z er
er iali
eriali zer
t ur
tur e
Ġ =
b j
o bj
" ,
ĠĠĠĠ ĠĠĠ
ĊĠĠĠĠ ĠĠĠĠĠĠĠ
g e
d e
u v
er ture
uv erture
i el
o d
S erializer
201 8
co uverture
iel d
u s
g et
Ġ get
a ge
) :
M et
us age
201 5
Ċ ĊĠĠĠ
c la
s s
co de
od el
cla ss
Ġ s
f ield
Ġ r
Ġ label
et ur
de f
Ġr etur
Ġretur n
( )
F ield
h od
s el
Ġ obj
Ġ def
Serializer Met
hod Field
sel f
SerializerMet hodField
o l
erializer s
a r
a ture
e s
m p
m odel
Ċ Ċ
Ġ (
Ġ class
M odel
c s
s erializers
Ġ )
Ġ Met
Ġ field
Ġ model
Model Serializer
ĠMet a
Ġfield s
G e
i d
t i
Ge o
F e
Ġ ge
Ġ couverture
ol y
ature ModelSerializer
mp oly
Geo Fe
Ġge o
GeoFe atureModelSerializer
a c
f ac
s ur
fac e
sur face
" "
f i
o m
Ġ i
Ġ usage
ti fi
tifi c
A r
S y
S ol
b ar
n es
o r
t o
v al
Ġ C
Ġ Ar
Sy bar
ĠAr tific
Sybar val
e n
f r
i n
e e
s ee
B a
E n
O cs
R en
U r
U s
V o
Z o
a in
b ain
e Ur
i e
i r
l e
m e
m u
o p
o uverture
p eUr
v el
Ġ Sybarval
Ġ En
Ġ Ocs
Ġ Ren
Ġ Us
Ġ Vo
Ġ Zo
iali see
iel le
age Sol
ature e
mp or
ti es
om mu
Ġi mpor
nes Sybarval
nes Ba
ĠC ouverture
ĠC ommu
ĠArtific ialisee
ĠArtific ielle
fr om
bain e
ir ie
op peUr
vel oppeUr
ĠEn veloppeUr
ĠOcs ge
ĠRen aturee
ĠUs ageSol
ĠVo irie
ĠZo nesBa
Ġimpor t
ĠCouverture Sol
ĠCommu nesSybarval
ĠEnveloppeUr baine
ĠZonesBa ties
. ""
M ar
N o
a me
i s
k er
n e
p ar
w or
Ġ code
Ġ No
Ġ" ""
Ġs erializer
Ġs erializers
Ġr es
Ġi f
Ġi s
en t
fr ame
."" "
Mar ker
par ent
wor k
ĠNo ne
Ġres t
frame work
" {
" ",
- "
3 0
= ""
= "",
J S
O N
[ :
] }
a p
a s
e ar
g is
i l
i me
l es
l or
m et
m ap
m il
n n
n om
y ear
Ċ ĊĠĠĠĠĠĠĠ
Ġ .
Ġ f
Ġ {
Ġ Geo
Ġ as
Ġ met
co lor
co nn
Ġ" -"
ar tific
model s
in see
in conn
ĠSybarval Serializer
ĠOcsge Serializer
ĠUsageSol Serializer
ĠCouvertureSol Serializer
ĠCommunesSybarval Serializer
="" ):
JS ON
]} "
les ime
mil lesime
ĠGeo JSON
Ġmet a
artific ial
inconn u
