{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<|endoftext|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": false,
    "use_regex": true
  },
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": "",
    "end_of_word_suffix": "",
    "fuse_unk": false,
    "byte_fallback": false,
    "vocab": {
      "<|endoftext|>": 0,
      "!": 1,
      "\"": 2,
      "#": 3,
      "$": 4,
      "%": 5,
      "&": 6,
      "'": 7,
      "(": 8,
      ")": 9,
      "*": 10,
      "+": 11,
      ",": 12,
      "-": 13,
      ".": 14,
      "/": 15,
      "0": 16,
      "1": 17,
      "2": 18,
      "3": 19,
      "4": 20,
      "5": 21,
      "6": 22,
      "7": 23,
      "8": 24,
      "9": 25,
      ":": 26,
      ";": 27,
      "<": 28,
      "=": 29,
      ">": 30,
      "?": 31,
      "@": 32,
      "A": 33,
      "B": 34,
      "C": 35,
      "D": 36,
      "E": 37,
      "F": 38,
      "G": 39,
      "H": 40,
      "I": 41,
      "J": 42,
      "K": 43,
      "L": 44,
      "M": 45,
      "N": 46,
      "O": 47,
      "P": 48,
      "Q": 49,
      "R": 50,
      "S": 51,
      "T": 52,
      "U": 53,
      "V": 54,
      "W": 55,
      "X": 56,
      "Y": 57,
      "Z": 58,
      "[": 59,
      "\\": 60,
      "]": 61,
      "^": 62,
      "_": 63,
      "`": 64,
      "a": 65,
      "b": 66,
      "c": 67,
      "d": 68,
      "e": 69,
      "f": 70,
      "g": 71,
      "h": 72,
      "i": 73,
      "j": 74,
      "k": 75,
      "l": 76,
      "m": 77,
      "n": 78,
      "o": 79,
      "p": 80,
      "q": 81,
      "r": 82,
      "s": 83,
      "t": 84,
      "u": 85,
      "v": 86,
      "w": 87,
      "x": 88,
      "y": 89,
      "z": 90,
      "{": 91,
      "|": 92,
      "}": 93,
      "~": 94,
      "¡": 95,
      "¢": 96,
      "£": 97,
      "¤": 98,
      "¥": 99,
      "¦": 100,
      "§": 101,
      "¨": 102,
      "©": 103,
      "ª": 104,
      "«": 105,
      "¬": 106,
      "®": 107,
      "¯": 108,
      "°": 109,
      "±": 110,
      "²": 111,
      "³": 112,
      "´": 113,
      "µ": 114,
      "¶": 115,
      "·": 116,
      "¸": 117,
      "¹": 118,
      "º": 119,
      "»": 120,
      "¼": 121,
      "½": 122,
      "¾": 123,
      "¿": 124,
      "À": 125,
      "Á": 126,
      "Â": 127,
      "Ã": 128,
      "Ä": 129,
      "Å": 130,
      "Æ": 131,
      "Ç": 132,
      "È": 133,
      "É": 134,
      "Ê": 135,
      "Ë": 136,
      "Ì": 137,
      "Í": 138,
      "Î": 139,
      "Ï": 140,
      "Ð": 141,
      "Ñ": 142,
      "Ò": 143,
      "Ó": 144,
      "Ô": 145,
      "Õ": 146,
      "Ö": 147,
      "×": 148,
      "Ø": 149,
      "Ù": 150,
      "Ú": 151,
      "Û": 152,
      "Ü": 153,
      "Ý": 154,
      "Þ": 155,
      "ß": 156,
      "à": 157,
      "á": 158,
      "â": 159,
      "ã": 160,
      "ä": 161,
      "å": 162,
      "æ": 163,
      "ç": 164,
      "è": 165,
      "é": 166,
      "ê": 167,
      "ë": 168,
      "ì": 169,
      "í": 170,
      "î": 171,
      "ï": 172,
      "ð": 173,
      "ñ": 174,
      "ò": 175,
      "ó": 176,
      "ô": 177,
      "õ": 178,
      "ö": 179,
      "÷": 180,
      "ø": 181,
      "ù": 182,
      "ú": 183,
      "û": 184,
      "ü": 185,
      "ý": 186,
      "þ": 187,
      "ÿ": 188,
      "Ā": 189,
      "ā": 190,
      "Ă": 191,
      "ă": 192,
      "Ą": 193,
      "ą": 194,
      "Ć": 195,
      "ć": 196,
      "Ĉ": 197,
      "ĉ": 198,
      "Ċ": 199,
      "ċ": 200,
      "Č": 201,
      "č": 202,
      "Ď": 203,
      "ď": 204,
      "Đ": 205,
      "đ": 206,
      "Ē": 207,
      "ē": 208,
      "Ĕ": 209,
      "ĕ": 210,
      "Ė": 211,
      "ė": 212,
      "Ę": 213,
      "ę": 214,
      "Ě": 215,
      "ě": 216,
      "Ĝ": 217,
      "ĝ": 218,
      "Ğ": 219,
      "ğ": 220,
      "Ġ": 221,
      "ġ": 222,
      "Ģ": 223,
      "ģ": 224,
      "Ĥ": 225,
      "ĥ": 226,
      "Ħ": 227,
      "ħ": 228,
      "Ĩ": 229,
      "ĩ": 230,
      "Ī": 231,
      "ī": 232,
      "Ĭ": 233,
      "ĭ": 234,
      "Į": 235,
      "į": 236,
      "İ": 237,
      "ı": 238,
      "Ĳ": 239,
      "ĳ": 240,
      "Ĵ": 241,
      "ĵ": 242,
      "Ķ": 243,
      "ķ": 244,
      "ĸ": 245,
      "Ĺ": 246,
      "ĺ": 247,
      "Ļ": 248,
      "ļ": 249,
      "Ľ": 250,
      "ľ": 251,
      "Ŀ": 252,
      "ŀ": 253,
      "Ł": 254,
      "ł": 255,
      "Ń": 256,
      "ĠĠ": 257,
      "ĠĠĠĠ": 258,
      "ĠĠĠ": 259,
      "er": 260,
      "el": 261,
      "ĊĠĠĠĠ": 262,
      "et": 263,
      "la": 264,
      "ur": 265,
      "01": 266,
      "201": 267,
      "al": 268,
      "co": 269,
      "ĊĠĠĠĠĠĠĠ": 270,
      "Ġ\"": 271,
      "ĊĠĠĠ": 272,
      "ial": 273,
      "iali": 274,
      "bel": 275,
      "label": 276,
      "zer": 277,
      "eriali": 278,
      "erializer": 279,
      "tur": 280,
      "ture": 281,
      "Ġ=": 282,
      "bj": 283,
      "obj": 284,
      "\",": 285,
      "ĠĠĠĠĠĠĠ": 286,
      "ĊĠĠĠĠĠĠĠĠĠĠĠ": 287,
      "ge": 288,
      "de": 289,
      "uv": 290,
      "erture": 291,
      "uverture": 292,
      "iel": 293,
      "od": 294,
      "Serializer": 295,
      "2018": 296,
      "couverture": 297,
      "ield": 298,
      "us": 299,
      "get": 300,
      "Ġget": 301,
      "age": 302,
      "):": 303,
      "Met": 304,
      "usage": 305,
      "2015": 306,
      "ĊĊĠĠĠ": 307,
      "cla": 308,
      "ss": 309,
      "code": 310,
      "odel": 311,
      "class": 312,
      "Ġs": 313,
      "field": 314,
      "Ġr": 315,
      "Ġlabel": 316,
      "etur": 317,
      "def": 318,
      "Ġretur": 319,
      "Ġreturn": 320,
      "()": 321,
      "Field": 322,
      "hod": 323,
      "sel": 324,
      "Ġobj": 325,
      "Ġdef": 326,
      "SerializerMet": 327,
      "hodField": 328,
      "self": 329,
      "SerializerMethodField": 330,
      "ol": 331,
      "erializers": 332,
      "ar": 333,
      "ature": 334,
      "es": 335,
      "mp": 336,
      "model": 337,
      "ĊĊ": 338,
      "Ġ(": 339,
      "Ġclass": 340,
      "Model": 341,
      "cs": 342,
      "serializers": 343,
      "Ġ)": 344,
      "ĠMet": 345,
      "Ġfield": 346,
      "Ġmodel": 347,
      "ModelSerializer": 348,
      "ĠMeta": 349,
      "Ġfields": 350,
      "Ge": 351,
      "id": 352,
      "ti": 353,
      "Geo": 354,
      "Fe": 355,
      "Ġge": 356,
      "Ġcouverture": 357,
      "oly": 358,
      "atureModelSerializer": 359,
      "mpoly": 360,
      "GeoFe": 361,
      "Ġgeo": 362,
      "GeoFeatureModelSerializer": 363,
      "ac": 364,
      "fac": 365,
      "sur": 366,
      "face": 367,
      "surface": 368,
      "\"\"": 369,
      "fi": 370,
      "om": 371,
      "Ġi": 372,
      "Ġusage": 373,
      "tifi": 374,
      "tific": 375,
      "Ar": 376,
      "Sy": 377,
      "Sol": 378,
      "bar": 379,
      "nes": 380,
      "or": 381,
      "to": 382,
      "val": 383,
      "ĠC": 384,
      "ĠAr": 385,
      "Sybar": 386,
      "ĠArtific": 387,
      "Sybarval": 388,
      "en": 389,
      "fr": 390,
      "in": 391,
      "ee": 392,
      "see": 393,
      "Ba": 394,
      "En": 395,
      "Ocs": 396,
      "Ren": 397,
      "Ur": 398,
      "Us": 399,
      "Vo": 400,
      "Zo": 401,
      "ain": 402,
      "bain": 403,
      "eUr": 404,
      "ie": 405,
      "ir": 406,
      "le": 407,
      "me": 408,
      "mu": 409,
      "op": 410,
      "ouverture": 411,
      "peUr": 412,
      "vel": 413,
      "ĠSybarval": 414,
      "ĠEn": 415,
      "ĠOcs": 416,
      "ĠRen": 417,
      "ĠUs": 418,
      "ĠVo": 419,
      "ĠZo": 420,
      "ialisee": 421,
      "ielle": 422,
      "ageSol": 423,
      "aturee": 424,
      "mpor": 425,
      "ties": 426,
      "ommu": 427,
      "Ġimpor": 428,
      "nesSybarval": 429,
      "nesBa": 430,
      "ĠCouverture": 431,
      "ĠCommu": 432,
      "ĠArtificialisee": 433,
      "ĠArtificielle": 434,
      "from": 435,
      "baine": 436,
      "irie": 437,
      "oppeUr": 438,
      "veloppeUr": 439,
      "ĠEnveloppeUr": 440,
      "ĠOcsge": 441,
      "ĠRenaturee": 442,
      "ĠUsageSol": 443,
      "ĠVoirie": 444,
      "ĠZonesBa": 445,
      "Ġimport": 446,
      "ĠCouvertureSol": 447,
      "ĠCommunesSybarval": 448,
      "ĠEnveloppeUrbaine": 449,
      "ĠZonesBaties": 450,
      ".\"\"": 451,
      "Mar": 452,
      "No": 453,
      "ame": 454,
      "is": 455,
      "ker": 456,
      "ne": 457,
      "par": 458,
      "wor": 459,
      "Ġcode": 460,
      "ĠNo": 461,
      "Ġ\"\"\"": 462,
      "Ġserializer": 463,
      "Ġserializers": 464,
      "Ġres": 465,
      "Ġif": 466,
      "Ġis": 467,
      "ent": 468,
      "frame": 469,
      ".\"\"\"": 470,
      "Marker": 471,
      "parent": 472,
      "work": 473,
      "ĠNone": 474,
      "Ġrest": 475,
      "framework": 476,
      "\"{": 477,
      "\"\",": 478,
      "-\"": 479,
      "30": 480,
      "=\"\"": 481,
      "=\"\",": 482,
      "JS": 483,
      "ON": 484,
      "[:": 485,
      "]}": 486,
      "ap": 487,
      "as": 488,
      "ear": 489,
      "gis": 490,
      "il": 491,
      "ime": 492,
      "les": 493,
      "lor": 494,
      "met": 495,
      "map": 496,
      "mil": 497,
      "nn": 498,
      "nom": 499,
      "year": 500,
      "ĊĊĠĠĠĠĠĠĠ": 501,
      "Ġ.": 502,
      "Ġf": 503,
      "Ġ{": 504,
      "ĠGeo": 505,
      "Ġas": 506,
      "Ġmet": 507,
      "color": 508,
      "conn": 509,
      "Ġ\"-\"": 510,
      "artific": 511,
      "models": 512,
      "insee": 513,
      "inconn": 514,
      "ĠSybarvalSerializer": 515,
      "ĠOcsgeSerializer": 516,
      "ĠUsageSolSerializer": 517,
      "ĠCouvertureSolSerializer": 518,
      "ĠCommunesSybarvalSerializer": 519,
      "=\"\"):": 520,
      "JSON": 521,
      "]}\"": 522,
      "lesime": 523,
      "millesime": 524,
      "ĠGeoJSON": 525,
      "Ġmeta": 526,
      "artificial": 527,
      "inconnu": 528
    },
    "merges": [
      "Ġ Ġ",
      "ĠĠ ĠĠ",
      "ĠĠ Ġ",
      "e r",
      "e l",
      "Ċ ĠĠĠĠ",
      "e t",
      "l a",
      "u r",
      "0 1",
      "2 01",
      "a l",
      "c o",
      "ĊĠĠĠĠ ĠĠĠ",
      "Ġ \"",
      "Ċ ĠĠĠ",
      "i al",
      "ial i",
      "b el",
      "la bel",
      "z er",
      "er iali",
      "eriali zer",
      "t ur",
      "tur e",
      "Ġ =",
      "b j",
      "o bj",
      "\" ,",
      "ĠĠĠĠ ĠĠĠ",
      "ĊĠĠĠĠ ĠĠĠĠĠĠĠ",
      "g e",
      "d e",
      "u v",
      "er ture",
      "uv erture",
      "i el",
      "o d",
      "S erializer",
      "201 8",
      "co uverture",
      "iel d",
      "u s",
      "g et",
      "Ġ get",
      "a ge",
      ") :",
      "M et",
      "us age",
      "201 5",
      "Ċ ĊĠĠĠ",
      "c la",
      "s s",
      "co de",
      "od el",
      "cla ss",
      "Ġ s",
      "f ield",
      "Ġ r",
      "Ġ label",
      "et ur",
      "de f",
      "Ġr etur",
      "Ġretur n",
      "( )",
      "F ield",
      "h od",
      "s el",
      "Ġ obj",
      "Ġ def",
      "Serializer Met",
      "hod Field",
      "sel f",
      "SerializerMet hodField",
      "o l",
      "erializer s",
      "a r",
      "a ture",
      "e s",
      "m p",
      "m odel",
      "Ċ Ċ",
      "Ġ (",
      "Ġ class",
      "M odel",
      "c s",
      "s erializers",
      "Ġ )",
      "Ġ Met",
      "Ġ field",
      "Ġ model",
      "Model Serializer",
      "ĠMet a",
      "Ġfield s",
      "G e",
      "i d",
      "t i",
      "Ge o",
      "F e",
      "Ġ ge",
      "Ġ couverture",
      "ol y",
      "ature ModelSerializer",
      "mp oly",
      "Geo Fe",
      "Ġge o",
      "GeoFe atureModelSerializer",
      "a c",
      "f ac",
      "s ur",
      "fac e",
      "sur face",
      "\" \"",
      "f i",
      "o m",
      "Ġ i",
      "Ġ usage",
      "ti fi",
      "tifi c",
      "A r",
      "S y",
      "S ol",
      "b ar",
      "n es",
      "o r",
      "t o",
      "v al",
      "Ġ C",
      "Ġ Ar",
      "Sy bar",
      "ĠAr tific",
      "Sybar val",
      "e n",
      "f r",
      "i n",
      "e e",
      "s ee",
      "B a",
      "E n",
      "O cs",
      "R en",
      "U r",
      "U s",
      "V o",
      "Z o",
      "a in",
      "b ain",
      "e Ur",
      "i e",
      "i r",
      "l e",
      "m e",
      "m u",
      "o p",
      "o uverture",
      "p eUr",
      "v el",
      "Ġ Sybarval",
      "Ġ En",
      "Ġ Ocs",
      "Ġ Ren",
      "Ġ Us",
      "Ġ Vo",
      "Ġ Zo",
      "iali see",
      "iel le",
      "age Sol",
      "ature e",
      "mp or",
      "ti es",
      "om mu",
      "Ġi mpor",
      "nes Sybarval",
      "nes Ba",
      "ĠC ouverture",
      "ĠC ommu",
      "ĠArtific ialisee",
      "ĠArtific ielle",
      "fr om",
      "bain e",
      "ir ie",
      "op peUr",
      "vel oppeUr",
      "ĠEn veloppeUr",
      "ĠOcs ge",
      "ĠRen aturee",
      "ĠUs ageSol",
      "ĠVo irie",
      "ĠZo nesBa",
      "Ġimpor t",
      "ĠCouverture Sol",
      "ĠCommu nesSybarval",
      "ĠEnveloppeUr baine",
      "ĠZonesBa ties",
      ". \"\"",
      "M ar",
      "N o",
      "a me",
      "i s",
      "k er",
      "n e",
      "p ar",
      "w or",
      "Ġ code",
      "Ġ No",
      "Ġ\" \"\"",
      "Ġs erializer",
      "Ġs erializers",
      "Ġr es",
      "Ġi f",
      "Ġi s",
      "en t",
      "fr ame",
      ".\"\" \"",
      "Mar ker",
      "par ent",
      "wor k",
      "ĠNo ne",
      "Ġres t",
      "frame work",
      "\" {",
      "\" \",",
      "- \"",
      "3 0",
      "= \"\"",
      "= \"\",",
      "J S",
      "O N",
      "[ :",
      "] }",
      "a p",
      "a s",
      "e ar",
      "g is",
      "i l",
      "i me",
      "l es",
      "l or",
      "m et",
      "m ap",
      "m il",
      "n n",
      "n om",
      "y ear",
      "Ċ ĊĠĠĠĠĠĠĠ",
      "Ġ .",
      "Ġ f",
      "Ġ {",
      "Ġ Geo",
      "Ġ as",
      "Ġ met",
      "co lor",
      "co nn",
      "Ġ\" -\"",
      "ar tific",
      "model s",
      "in see",
      "in conn",
      "ĠSybarval Serializer",
      "ĠOcsge Serializer",
      "ĠUsageSol Serializer",
      "ĠCouvertureSol Serializer",
      "ĠCommunesSybarval Serializer",
      "=\"\" ):",
      "JS ON",
      "]} \"",
      "les ime",
      "mil lesime",
      "ĠGeo JSON",
      "Ġmet a",
      "artific ial",
      "inconn u"
    ]
  }
}